In [1]:
import pandas as pd

In [7]:
# is sub string?
string1 = "rewa"
string2 = " werb e453qa5wx"

def is_substring1(string1, string2):
    p = 0
    for c in string1:
        for i in range(p, len(string2)):
            if c == string2[i]:
                p += 1
                break 
        else:
            return False 
    return True 

print(is_substring1(string1, string2))

def is_substring2(string1, string2):
    """ better version with two pointers: O(n+m)"""
    p1=p2=0
    while p1 < len(string1) and p2 < len(string2):
        if string1[p1] == string2[p2]:
            p1 += 1
        p2 += 1
    return p1 == len(string1) - 1 
print(is_substring2(string1, string2))

True
True

In [19]:
data = [12, 21, 43, 21, 15, 30, 10]
# 10, 12, 15 #21# 21, 30, 43
# # q1= 12, q3=30
# iqr = 18
def get_quantile_pd(data, q):
    """quantile using pandas
    pandas use index: 
    number of data * quantile => location of the quantile"""
    series = pd.Series(data)
    return series.quantile(q)

q1, q3 = get_quantile_pd(data, [0.25,0.75])
print(q1, q3, q3-q1)

def get_quantile_range(data):
    """get Q1, Q3, and Q3-Q1
    using median method!!"""
    #should sort data 
    data.sort()
    # find left and right half
    n = len(data)
    if n % 2 == 0:
        # 0,1,2,3
        left = data[:n//2]
        right = data[n//2:]
    else:
        #0,1,2
        left = data[:n//2]
        right = data[n//2 + 1:]
    # find median of left and right 
    def median(arr):
        """ return median index"""
        n = len(arr)
        if n % 2 == 0:
            #0,1,2,3
            return (arr[n//2-1] + arr[n//2+1]) / 2
        else:
            #0,1,2
            return arr[n//2]
    
    q1 = median(left)
    q3 = median(right)
    print(q1, q3, q3-q1)        
        
get_quantile_range(data)

13.5 25.5 12.0
12 30 18

In [36]:
roman = [
    (1, 'I'), (4, 'IV'), (5, 'V'), 
    (9, 'IV'), (10, 'X'), (40, 'XL'),
    (50, 'L'), (90, 'XC'), (100, 'C'),
    (400, 'CD'), (500, 'D'), (900, 'CM'),
    (1000, 'M')
]
roman
dict(roman)

{1: 'I',
 4: 'IV',
 5: 'V',
 9: 'IV',
 10: 'X',
 40: 'XL',
 50: 'L',
 90: 'XC',
 100: 'C',
 400: 'CD',
 500: 'D',
 900: 'CM',
 1000: 'M'}

In [49]:
dt1 = pd.to_datetime('2/1/2024 9:30')
dt2 = pd.to_datetime('2/3/2024 10:11')
delta = dt2 - dt1
print(delta)
print(delta.seconds)
print(delta.seconds / 60*2)

2 days 00:41:00
2460
82.0

In [50]:
data = {
    'id': [1, 2, 3, 4, 5, 6],
    'user_id': [1, 2, 1, 3, 4, 5],
    'user_name': ['Jack', 'Alice', 'Jack', 'Scott', 'James', 'Sean'],
    'user_ratings': [894, 311, 233, 852, 922, 579],
    'created_at': ['2022-01-01', '2022-01-01', '2022-01-02', '2022-01-03', '2022-01-03', '2022-01-04'],
    'product_id': [101, 102, 103, 104, 105, 106],
    'quantity': [1, 1, 1, 1, 1, 1]
}
df = pd.DataFrame(data)
df

   id  user_id user_name  user_ratings  created_at  product_id  quantity
0   1        1      Jack           894  2022-01-01         101         1
1   2        2     Alice           311  2022-01-01         102         1
2   3        1      Jack           233  2022-01-02         103         1
3   4        3     Scott           852  2022-01-03         104         1
4   5        4     James           922  2022-01-03         105         1
5   6        5      Sean           579  2022-01-04         106         1

In [58]:
avg_rows = df[['user_ratings', 'product_id']].mean(axis=1)
print(avg_rows)
print(avg_rows.index)

0    497.5
1    206.5
2    168.0
3    478.0
4    513.5
5    342.5
dtype: float64
RangeIndex(start=0, stop=6, step=1)

In [72]:
# Example movie rating data
data = {
    'User1': [5, 4, None, 2],
    'User2': [3, None, 5, 2],
    'User3': [None, 4, 3, 1]
}

# Create a DataFrame
df = pd.DataFrame(data)

# Fill missing values with row-wise mean
df_filled = df.apply(lambda row: row.fillna(row.mean()), axis=1)
print(df)
print(df_filled)

   User1  User2  User3
0    5.0    3.0    NaN
1    4.0    NaN    4.0
2    NaN    5.0    3.0
3    2.0    2.0    1.0
   User1  User2  User3
0    5.0    3.0    4.0
1    4.0    4.0    4.0
2    4.0    5.0    3.0
3    2.0    2.0    1.0

In [73]:
# Example movie rating data
data = {
    'User1': [5, 4, None, 2],
    'User2': [3, None, 5, 2],
    'User3': [None, 4, 3, 1]
}

# Create a DataFrame
df = pd.DataFrame(data)
df = df.apply(lambda col: col.fillna(round(col.mean(),1)), axis= 0)
df['label']= ['a', 'b', 'a', 'b']
df

   User1  User2  User3 label
0    5.0    3.0    2.7     a
1    4.0    3.3    4.0     b
2    3.7    5.0    3.0     a
3    2.0    2.0    1.0     b

In [74]:
df.groupby(by='label').rolling(2).sum()

         User1  User2  User3
label
a     0    NaN    NaN    NaN
      2    8.7    8.0    5.7
b     1    NaN    NaN    NaN
      3    6.0    5.3    5.0

In [77]:
df.groupby('label', as_index=False).rolling(2).sum()

  label  User1  User2  User3
0     a    NaN    NaN    NaN
2     a    8.7    8.0    5.7
1     b    NaN    NaN    NaN
3     b    6.0    5.3    5.0

In [76]:
df.groupby('label', as_index=False).rolling(2).sum().sort_index()

  label  User1  User2  User3
0     a    NaN    NaN    NaN
1     b    NaN    NaN    NaN
2     a    8.7    8.0    5.7
3     b    6.0    5.3    5.0

In [78]:
data = [[1, 2, 3], [1, 5, 6], [2, 5, 8], [2, 6, 9]]
df = pd.DataFrame(data, columns=["a", "b", "c"],
                  index=["tuna", "salmon", "catfish", "goldfish"])
df

          a  b  c
tuna      1  2  3
salmon    1  5  6
catfish   2  5  8
goldfish  2  6  9

In [98]:
# convert list of dictionary to dictionary of dictionoary

from collections import defaultdict
truck_locations = [
    {"model": "BMW", "location": (1, 2)},
    {"model": "Mercedes", "location": (2, 3)},
    {"model": "Mercedes", "location": (2, 2)},
    {"model": "Mercedes", "location": (2, 3)},
    {"model": "BMW", "location": (1, 2)},
    {"model": "BMW", "location": (3, 3)}]
# 1. model: list of location
model_locations = {}
for t_dict in truck_locations:
    model = t_dict['model']
    location = t_dict['location']
    if model in model_locations: 
        model_locations[model].append(location)
    else:
        model_locations[model] = [location]
print(model_locations)

# 2. dictionary of dictionary 
# {model: {location: counts}}
model_loc_counts = {}
for t_dict in truck_locations:
    model = t_dict['model']
    location = t_dict['location']
    if model in model_loc_counts:
        loc_counts = model_loc_counts[model]
        loc_counts[location] = 1 + loc_counts.get(location, 0)
    else:
        model_loc_counts[model] = {location:1}
print(model_loc_counts)

{'BMW': [(1, 2), (1, 2), (3, 3)], 'Mercedes': [(2, 3), (2, 2), (2, 3)]}
{'BMW': {(1, 2): 2, (3, 3): 1}, 'Mercedes': {(2, 3): 2, (2, 2): 1}}

In [13]:
import json
json_str = json.dumps({'a':{'b':'c', 'd':'e'}})
print(json_str)
print(type(json_str))
print(json.loads(json_str))
print(type(json.loads(json_str)))

{"a": {"b": "c", "d": "e"}}
<class 'str'>
{'a': {'b': 'c', 'd': 'e'}}
<class 'dict'>

In [20]:
data = json.loads(json_str)
res_dict = {}
def flatten_dic(key_list, sub_obj):
    if isinstance(sub_obj, dict):
        for key in sub_obj:
            flatten_dic(key_list + [key], sub_obj[key])
    else: 
        key_str = '_'.join(key_list)
        res_dict[key_str] = sub_obj
             

flatten_dic([], data)
print(json.dumps(res_dict))

{"a_b": "c", "a_d": "e"}

In [18]:
a = []
a + [1]
a

[]

In [4]:
# find max from dictionary of dictionary
model_loc = {'BMW': {(1, 2): 2, (3, 3): 1}, 'Mercedes': {(2, 3): 2, (2, 2): 1}}

max_model_loc = {}
for model in model_loc:
    loc_dict = model_loc[model]
    cnt = 0
    max_loc = None 
    for loc in loc_dict:
        if loc_dict[loc] > cnt:
            cnt = loc_dict[loc]
            max_loc = loc
    max_model_loc[model] = max_loc 

print(max_model_loc)

{'BMW': (1, 2), 'Mercedes': (2, 3)}